# Приклади збільшення/зменшення довжини списку
# створити список
A = []
# сформувати список з 10 елементів з допомогою вводу з клавіатури
i=0
while i<10:
    x = float(input("x = "))
    A = A+[x] # збільшення списку
    i=i+1

print("Вихідний список")
print("A = ",A)

print("Зменшення списку A на 3 елементи")
i=0
while i<3:
    n = len(A) # взяти довжину списку
    del A[n-1] # видалити останній елемент списку
    i=i+1
print("A = ", A)

print("Зменшення списку ще на 2 останні елементи")
del A[n-3:n-1]
print("A = ", A)