import solution_fun

# Знайдіть максимальне значення в списку, що передається в функцію, і поверніть його, якщо воно більше 0, інакше поверніть повідомлення про те, що число менше 0.
print(solution_fun.one([-1,-2,-3,-4,-5,-6,-7]))

#Поверніть кількість літер у слові, яке надсилається у параметрах.
print(solution_fun.word('Hello'))

#Напишіть функцію, яка підносить до степеня число, яке передається у параметрах якщо степінь не від'ємний. Перший параметр - число, другий - степінь
print(solution_fun.power(2,2))

#Напишіть функцію, де дано натуральне число n. Виведіть усі числа від 1 до n.
solution_fun.index(10)

#Напишіть функцію для розрахунку площі прямокутника, у параметрах
print(solution_fun.s(0,2))
