#Знайдіть максимальне значення в списку, що передається в функцію, і поверніть його, якщо воно більше 0, інакше поверніть повідомлення про те, що число менше 0.
def one(a):
    maximum = max(a)
    if maximum > 0:
        return maximum
    else: return "Число менше 0"

#Поверніть кількість літер у слові, яке надсилається у параметрах.
def word(w):
    length = len(w)
    return length



#Напишіть функцію, яка підносить до степеня число, яке передається у параметрах якщо степінь не від'ємний. Перший параметр - число, другий - степінь
def power(a,b):
    if b>=0:
        result = a ** b
        return result
    else:
         return "Степінь має бути не від'ємним"


#Напишіть функцію, де дано натуральне число n. Виведіть усі числа від 1 до n.
def index(n):
     if n <= 0:
        print("n має бути натуральним числом.")
        return
     for n in range (1, n+1):
         print(n)


#Напишіть функцію для розрахунку площі прямокутника, у параметрах
def s(a,b):
    if a>0 and b>0:
        return a*b
    else:
        return "Площі не існує"




